Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `call` is often used when you need to implement asynchronous side-effects, such as closing resources.
ja_jp: `call` リソースを閉じるなど、非同期の副作用を実装する必要がある場合によく使われます。

source: `callback` -- Hibernate Validator will perform the lifecycle event validation.
ja_jp: `callback` -- Hibernate Validator がライフサイクルイベントのバリデーションを実行します。

source: `case` is an alias for `is`.
ja_jp: `case` は `is` の別名です。

source: `checkGeneratedSource()` validate a class against the snapshots for all languages (or a specific one).
ja_jp: `checkGeneratedSource()` は、すべての言語（または特定の言語）のスナップショットに対してクラスを検証します。

source: `checkGeneratedTestSource()` validate a test class against the snapshots for all languages (or a specific one).
ja_jp: `checkGeneratedTestSource()` は、すべての言語（または特定の言語）のスナップショットに対してテストクラスを検証します。

source: `checkpoint` allows persisting consumer offsets on a **state store**, instead of committing them back to the Kafka broker. Using the `CheckpointMetadata` API, consumer code can persist a _processing state_ with the record offset to mark the progress of a consumer. When the processing continues from a previously persisted offset, it seeks the Kafka consumer to that offset and also restores the persisted state, continuing the stateful processing from where it left off. The checkpoint strategy holds locally the processing state associated with the latest offset, and persists it periodically to the state store (period specified by `auto.commit.interval.ms` (default: 5000)). The connector will be marked as unhealthy if no processing state is persisted to the state store in `checkpoint.unsynced-state-max-age.ms` (default: 10000). If `checkpoint.unsynced-state-max-age.ms` is set to less than or equal to 0, it does not perform any health check verification. For more information, see <<stateful-processing-checkpointing>>
ja_jp: `checkpoint` を使用すると、コンシューマーオフセットを Kafka ブローカーにコミットするのではなく、**ステートストア** に永続化できます。 `CheckpointMetadata` API を使用すると、コンシューマーコードはレコードオフセットを使用して _処理ステート_ を永続化し、コンシューマーの進行状況をマークできます。 処理が以前に永続化されたオフセットから続行される場合、Kafka コンシューマーをそのオフセットまでシークし、永続化されたステートを復元して、中断したところからステートフル処理を続行します。 チェックポイントストラテジーは、最新のオフセットに関連付けられた処理ステートをローカルに保持し、それを定期的にステートストアに永続化されます (期間は `auto.commit.interval.ms` で指定されます (デフォルト: 5000))。 処理ステートが `checkpoint.unsynced-state-max-age.ms` のステートストアに永続化されていない場合、コネクターは unhealthy とマークされます (デフォルト: 10000)。 `checkpoint.unsynced-state-max-age.ms` が 0 以下に設定されている場合、ヘルスチェック検証は実行されません。 詳細は、<<stateful-processing-checkpointing>> を参照してください。

source: `checksTimer`: A compound metric that benchmarks how much time the primality tests take. Additional details are provided later.
ja_jp: `checksTimer`: 素数テストにどれだけの時間がかかるかをベンチマークする複合メトリクス。詳細は後述します。

source: `checksTimer`: A compound metric that benchmarks how much time the primality tests take. All durations are measured in milliseconds. It consists of these values below.
ja_jp: `checksTimer`: 素数テストにかかる時間を計測する複合メトリクスです。すべての時間はミリ秒単位で測定されます。以下の値で構成されています。

source: `checks` -- an array of individual checks
ja_jp: `checks` -- 個別チェック結果の配列

source: `class:` followed by the fully-qualified name of a class, to be instantiated through CDI if it's a CDI bean, or through its public, no-argument constructor otherwise. For example `class:com.mycompany.MyClass`.
ja_jp: `class:` の後にクラスの完全修飾名を付けて、CDI Beanの場合は CDI を通して、そうでない場合はパブリックで引数なしのコンストラクタを通してインスタンス化されます。例えば `class:com.mycompany.MyClass` .

source: `classDirectories` needs to be read after evaluation phase in Gradle
ja_jp: Gradle では、評価フェーズの後に `classDirectories` を読み込む必要があります

source: `client1` is configured to use the `my-proxy` proxy configuration.
ja_jp: `client1` は `my-proxy` プロキシー設定を使用するように構成されています。

source: `client2` does not specify a proxy configuration name, so it will not use any proxy unless a default proxy configuration is defined.
ja_jp: `client2` はプロキシー設定名を指定しないため、デフォルトのプロキシー設定が定義されていない限り、プロキシーを使用しません。

source: `client_secret_jwt`, signature algorithm is HS256:
ja_jp: `client_secret_jwt`、署名アルゴリズムは HS256 です。

source: `client_secret_jwt`, signature algorithm is `HS256`:
ja_jp: `client_secret_jwt`、署名アルゴリズムは `HS256` です。

source: `client` - the JVM will start in client mode and attempt to connect to `localhost:5005`
ja_jp: `client` - JVM はクライアントモードで起動し、 `localhost:5005` に接続を試みます。

source: `codestart-data` is a source of data for various codestarts
ja_jp: `codestart-data` は様々なコードスタートのためのデータソースです。

source: `codestart.yml` is the only required file.
ja_jp: `codestart.yml` は唯一の必須ファイルです。

source: `codestart.yml` must be at the root of the codestart
ja_jp: `codestart.yml` は Codestart のルートに配置される必要があります。

source: `com.example.Basic*`: all classes in package `com.example` starting with `Basic`
ja_jp: `com.example.Basic*`: パッケージ `com.example` 内の `Basic` で始まるすべてのクラス

source: `com.example.IntegTest.fast*`: the class `com.example.IntegTest`, and in it, only methods starting with `fast`
ja_jp: `com.example.IntegTest.fast*`: クラス `com.example.IntegTest`、およびその中の `fast` で始まるメソッドのみ

source: `com.google.protobuf:protobuf-kotlin` needs to be included as dependency in the project.
ja_jp: `com.google.protobuf:protobuf-kotlin` をプロジェクトの依存関係として含める必要があります。

source: `com.google.protobuf:protoc:VERSION:exe:linux-aarch_64` and `io.grpc:protoc-gen-grpc-java:VERSION:exe:linux-aarch_64`
ja_jp: `com.google.protobuf:protoc:VERSION:exe:linux-aarch_64` および `io.grpc:protoc-gen-grpc-java:VERSION:exe:linux-aarch_64`

source: `com.google.protobuf:protoc:VERSION:exe:linux-ppcle_64` and `io.grpc:protoc-gen-grpc-java:VERSION:exe:linux-ppcle_64`
ja_jp: `com.google.protobuf:protoc:VERSION:exe:linux-ppcle_64` および `io.grpc:protoc-gen-grpc-java:VERSION:exe:linux-ppcle_64`

source: `com.google.protobuf:protoc:VERSION:exe:linux-s390_64` and `io.grpc:protoc-gen-grpc-java:VERSION:exe:linux-s390_64`
ja_jp: `com.google.protobuf:protoc:VERSION:exe:linux-s390_64` および `io.grpc:protoc-gen-grpc-java:VERSION:exe:linux-s390_64`

source: `com.google.protobuf:protoc:VERSION:exe:linux-x86_32` and `io.grpc:protoc-gen-grpc-java:VERSION:exe:linux-x86_32`
ja_jp: `com.google.protobuf:protoc:VERSION:exe:linux-x86_32` および `io.grpc:protoc-gen-grpc-java:VERSION:exe:linux-x86_32`

source: `com.google.protobuf:protoc:VERSION:exe:linux-x86_64` and `io.grpc:protoc-gen-grpc-java:VERSION:exe:linux-x86_64`
ja_jp: `com.google.protobuf:protoc:VERSION:exe:linux-x86_64` および `io.grpc:protoc-gen-grpc-java:VERSION:exe:linux-x86_64`

source: `com.google.protobuf:protoc:VERSION:exe:osx-aarch_64` and `io.grpc:protoc-gen-grpc-java:VERSION:exe:osx-aarch_64`
ja_jp: `com.google.protobuf:protoc:VERSION:exe:osx-aarch_64` および `io.grpc:protoc-gen-grpc-java:VERSION:exe:osx-aarch_64`

source: `com.google.protobuf:protoc:VERSION:exe:osx-x86_64` and `io.grpc:protoc-gen-grpc-java:VERSION:exe:osx-x86_64`
ja_jp: `com.google.protobuf:protoc:VERSION:exe:osx-x86_64` および `io.grpc:protoc-gen-grpc-java:VERSION:exe:osx-x86_64`

source: `com.google.protobuf:protoc:VERSION:exe:windows-x86_32` and `io.grpc:protoc-gen-grpc-java:VERSION:exe:windows-x86_32`
ja_jp: `com.google.protobuf:protoc:VERSION:exe:windows-x86_32` および `io.grpc:protoc-gen-grpc-java:VERSION:exe:windows-x86_32`

source: `com.google.protobuf:protoc:VERSION:exe:windows-x86_64` and `io.grpc:protoc-gen-grpc-java:VERSION:exe:windows-x86_64`
ja_jp: `com.google.protobuf:protoc:VERSION:exe:windows-x86_64` および `io.grpc:protoc-gen-grpc-java:VERSION:exe:windows-x86_64`

source: `common.prop` value is `common`
ja_jp: `common.prop` 値は `common`

source: `config:<name>` or `config:[<name>]`: Returns the config value for the given property name
ja_jp: `config:<name>` または `config:[<name>]`: 与えられたプロパティー名に対する config 値を返します。

source: `config:boolean(name)`: Returns the config value for the given property name as a boolean; the name can be obtained dynamically by an expression
ja_jp: `config:boolean(name)`: 指定したプロパティー名の設定値をbooleanとして返します。名前は式で動的に取得することが可能です。

source: `config:integer(name)`: Returns the config value for the given property name as an integer; the name can be obtained dynamically by an expression
ja_jp: `config:integer(name)`: 指定したプロパティー名の設定値をintegerで返します。名前は式で動的に取得することが可能です。

source: `config:property(name)`: Returns the config value for the given property name; the name can be obtained dynamically by an expression
ja_jp: `config:property(name)` : 指定したプロパティー名の設定値を返します。名前は式で動的に取得することが可能です。

source: `connectedCallback` is a method from Lit that gets called when this component is connected to the DOM. This is a good place to do 'page load' type things, like fetching data from the backend (we will discuss this later)
ja_jp: `connectedCallback` は Lit のメソッドで、このコンポーネントが DOM に接続されたときに呼び出されます。ここは、バックエンドからデータを取得するなど、「ページロード」のような処理を行うのに適した場所です (これについては後で説明します)。

source: `connection.begin()` returns a `Uni<Transaction>`
ja_jp: `connection.begin()`は `Uni<Transaction>` を返します。

source: `context.methodParameters().get(1).value()` which allows the `calculateContentType` method to obtain the proper method parameter passed to the REST Client method.
ja_jp: `context.methodParameters().get(1).value()` により、 `calculateContentType` メソッドは REST Client メソッドに渡される適切なメソッドパラメーターを取得できるようになります。

source: `continue` the failure is logged, but processing continues without applying acknowledgement or negative acknowledgement. This strategy can be used with <<ack-timeout>> configuration.
ja_jp: `continue` の場合、失敗がログに記録されますが、確認応答や否定応答を適用せずに処理が続行されます。このストラテジーは、<<ack-timeout>> 設定とともに使用できます。

source: `count` - 1-based index
ja_jp: `count` - 1 を基準としたインデックス

source: `count`: The number of observations, the value of which is the same as `performedChecks`.
ja_jp: `count`: 観測した数で、その値は `performedChecks` と同じです。

source: `create-table` (_boolean_): When set to `true`, the transaction log table gets automatically created if it does not already exist. The default value is `false`.
ja_jp: `create-table` (_boolean_）: `true` に設定すると、トランザクション・ログ・テーブルが存在しない場合、自動的に作成されます。 デフォルト値は `false` です。

source: `createServiceDiscovery` method is the factory method. It receives the configuration and access to the name of the service and available infrastructure.
ja_jp: `createServiceDiscovery` メソッドは、ファクトリーメソッドです。このメソッドは、設定を受け取り、サービスの名前と利用可能なインフラへのアクセスを行います。

source: `curl` command for `/secured/permit-all`
ja_jp: `/secured/permit-all` の `curl` コマンド

source: `curl` command for `/secured/roles-allowed`
ja_jp: /secured/roles-allowed の curl コマンド

source: `curl` command for `/secured/roles-allowed` with JWT
ja_jp: JWT を含む /secured/roles-allowed の curl コマンド

source: `currentUser` conflicts with the global variable supplied by `Globals#user()`.
ja_jp: `currentUser` は `Globals#user()` が提供するグローバル変数と競合しています。

source: `datasource` (_string_): Specify the name of the datasource for the transaction log storage. If no value is provided for the `datasource` property, Quarkus uses the xref:datasource.adoc#configure-datasources[default datasource].
ja_jp: `datasource` (_string_）：トランザクションログストレージのデータソース名を指定します。 プロパティに値が指定されていない場合、Quarkusは `datasource` xref:datasource.adoc#configure-datasources[デフォルトのデータソース] を使用します。

source: `ddl` -- Hibernate Validator constraints will be considered for the <<dev-mode,DDL operations>>
ja_jp: `ddl` -- Hibernate Validator の制約が <<dev-mode,DDL 操作>> で考慮されます。

source: `dead-letter-queue.key.serializer`: the serializer used to write the record key on the dead letter queue. By default, it deduces the serializer from the key deserializer.
ja_jp: `dead-letter-queue.key.serializer`: デッドレターキューにレコードキーを書き込むために使用されるシリアライザー。デフォルトでは、キーデシリアライザーからシリアライザーを推測します。

source: `dead-letter-queue.topic`: the topic to use to write the records not processed correctly, default is `dead-letter-topic-$channel`, with `$channel` being the name of the channel.
ja_jp: `dead-letter-queue.topic`: 正しく処理されなかったレコードを書き込むために使用するトピック。デフォルトは `dead-letter-topic-$channel` で、 `$channel` はチャネルの名前です。

source: `dead-letter-queue.value.serializer`: the serializer used to write the record value on the dead letter queue. By default, it deduces the serializer from the value deserializer.
ja_jp: `dead-letter-queue.value.serializer`: デッドレターキューにレコード値を書き込むために使用されるシリアライザー。デフォルトでは、値デシリアライザーからシリアライザーを推測します。

source: `dead-letter-queue`: the offset of the record that has not been processed correctly is committed, but the record is written to a Kafka dead letter topic.
ja_jp: `dead-letter-queue`: 正しく処理されなかったレコードのオフセットはコミットされますが、レコードは Kafka デッドレタートピックに書き込まれます。

source: `decr` and `decrby` - allows decrementing the stored value
ja_jp: `decr` および `decrby`: 格納された値を減らすことができます。

source: `description` (unless you have it already set in the ``runtime/pom.xml``'s `<description>` element, which is the recommended approach)
ja_jp: `description` (推奨アプローチのとおり runtime/pom.xml の `<description>` 要素にすでに設定されていない限り）

source: `description`: Shown as the card's summary.
ja_jp: `description`: カードの要約として表示されます。

source: `dev.prop` value is `dev`
ja_jp: `dev.prop` 値は `dev`

source: `disableQuarkusComponentVariants` project property was introduced in Quarkus 3.25.1 to control whether Quarkus component variants should be added to certain dependencies of a project to enable xref:conditional-extension-dependencies.adoc[Quarkus conditional] and build time (deployment) dependencies. Quarkus component variants are enabled by default since 3.25.1.
ja_jp: `disableQuarkusComponentVariants` プロジェクトプロパティーは、xref:conditional-extension-dependencies.adoc[Quarkus の条件付き] およびビルド時 (デプロイメント) の依存関係を有効にするために、Quarkus 3.25.1 で導入されました。Quarkus コンポーネントバリアントは、3.25.1 以降、デフォルトで有効になっています。

source: `disconnectedCallback` is a method from Lit that gets called when this component is disconnected from the DOM. This is a good place to do any clean up.
ja_jp: `disconnectedCallback` は Lit のメソッドで、このコンポーネントが DOM から切断されたときに呼び出されます。ここは、クリーンアップを行うのに適した場所です。

source: `displayName` is a human-palatable name for the user account. Optional.
ja_jp: `displayName` は、判読しやすいユーザーアカウントの名前です。オプションです。

source: `display` is a field within each method that shows a shortened id of the method, that includes package and classname (only the first letter of each), and the method name in camel case with single letters. E.g. `j.p.EM.persist` would be the `display` for the `persist` method in `javax.persistence.EntityManager`.
ja_jp: `display` は、各メソッド内のフィールドで、パッケージとクラス名（それぞれの最初の文字のみ）、およびキャメルケースのシングルレターのメソッド名を含む、メソッドの短縮されたIDを示します。例： `j.p.EM.persist` は、 `javax.persistence.EntityManager` の `persist` メソッドの `display` となります。

source: `doSomethingElse` can be executed if the current logged in user is the same as the `name` field of `person` method parameter
ja_jp: 現在ログインしているユーザーが `person` メソッドパラメーターの `name` フィールドと同じである場合、 `doSomethingElse` を実行できます

source: `doSomethingElse` can be executed if the current logged-in user is the same as the `name` field of `person` method parameter
ja_jp: 現在ログインしているユーザーが `person` メソッドパラメーターの `name` フィールドと同じである場合、 `doSomethingElse` を実行できます

source: `doSomething` can be executed if the current logged in user is the same as the `username` method parameter
ja_jp: 現在ログインしているユーザーが `username` メソッドパラメーターと同じである場合、 `doSomething` を実行できます

source: `doSomething` can be executed if the current logged-in user is the same as the `username` method parameter
ja_jp: 現在ログインしているユーザーが `username` メソッドパラメーターと同じである場合、 `doSomething` を実行できます

source: `docker buildx build` ONLY supports https://docs.docker.com/engine/reference/commandline/buildx_build/#load[loading the result of a build] to `docker images` when building for a single platform. Therefore, if you specify more than one argument in the `quarkus.docker.buildx.platform` property, the resulting images will not be loaded into `docker images`. If `quarkus.docker.buildx.platform` is omitted or if only a single platform is specified, it will then be loaded into `docker images`.
ja_jp: `docker buildx build` は、単一のプラットフォーム向けにビルドする場合のみ、link:https://docs.docker.com/engine/reference/commandline/buildx_build/#load[ビルド結果の `docker images` への読み込み] をサポートします。したがって、 `quarkus.docker.buildx.platform` プロパティに複数の引数を指定した場合、結果のイメージは `docker images` にロードされません。 `quarkus.docker.buildx.platform` が省略された場合、または単一のプラットフォームのみが指定された場合は、その後 `docker images` にロードされるようになります。

source: `docker ps` allows for more advanced retrieval of container information using the `--format` argument. For example, to get the running container ID, the image, the labels and the ports, the following command can be used:
ja_jp: `docker ps` では、 `--format` 引数を使用して、より高度なコンテナ情報の取得が可能です。例えば、実行中のコンテナID、イメージ、ラベル、ポートを取得するには、以下のようなコマンドを使用することができます。

source: `double` and `java.lang.Double`
ja_jp: `double` および`java.lang.Double`

source: `drop-table` (_boolean_): When set to `true`, the tables are dropped on startup if they already exist. The default value is `false`.
ja_jp: `drop-table` (_boolean_）: `true` に設定すると、テーブルが既に存在する場合は起動時に削除されます。 デフォルト値は `false` です。

source: `each` Iteration Metadata Example
ja_jp: `each` イテレーションのメタデータの例

source: `else` is block is executed if no other block matches the value.
ja_jp: `else` は、他のブロックが値に一致しない場合に実行されます。

source: `en-GB.js` — British English (only overrides)
ja_jp: `en-GB.js` — イギリス英語 (オーバーライドのみ)

source: `en-US.js` — American English (only overrides)
ja_jp: `en-US.js` — アメリカ英語 (オーバーライドのみ)

source: `en.js` — base English
ja_jp: `en.js` — ベース英語

source: `enable` - a name segment which corresponds to `enable` field in `FileConfig`.
ja_jp: `enable` - `FileConfig` クラスの `enable` フィールドに対応する名前セグメント。

source: `enabled?=true` is a short version of `enabled=enabled.or(true)`.
ja_jp: `enabled?=true` は `enabled=enabled.or(true)` の短縮版です。

source: `enabled` - a name segment which corresponds to `enable` field in `FileConfig` class annotated with `@ConfigGroup`.
ja_jp: `enabled` - `@ConfigGroup` アノテーションが付けられた `FileConfig` クラスの `enable` フィールドに対応する名前セグメント。

source: `enabled` - a name segment which corresponds to `enabled` field in `FileConfig`.
ja_jp: `enabled` - `FileConfig` の `enabled` フィールドに対応する名前セグメント。

source: `env-vars` properties
ja_jp: env-vars プロパティー

source: `even` - `true` if the element's count is even
ja_jp: `hasNext` - イテレーションにさらに要素がある場合に `true`

source: `even` - `true` if the zero-based index is even
ja_jp: `even` - ゼロ基準のインデックスが偶数であれば `true` となります。

source: `evidence.occurrences.location` was introduced in CycloneDX schema version 1.5, for older versions the location will be indicated using the `quarkus:component:location` property.
ja_jp: たとえば、 `evidence.occurrences.location` は CycloneDX スキーマバージョン 1.5 で導入されました。古いバージョンでは、場所は `quarkus:component:location` プロパティーを使用して示されます。

source: `ex(seconds)` - Set the specified expire time, in seconds.
ja_jp: `ex(seconds)`: 指定された有効期限を秒単位で設定します。

source: `example.prime.number` is the counter name.
ja_jp: `example.prime.number` はカウンター名です。

source: `example_prime_number_test_seconds_count` -- how many times the method was called
ja_jp: `example_prime_number_test_seconds_count` -- メソッドが呼び出された回数

source: `example_prime_number_test_seconds_max` -- the maximum observed duration within a decaying interval. This value will return to 0 if the method is not invoked frequently.
ja_jp: `example_prime_number_test_seconds_max` -- 減衰間隔内での最大観測時間。メソッドが頻繁に呼び出されない場合、この値は 0 に戻ります。

source: `example_prime_number_test_seconds_sum` -- the total duration of all method calls
ja_jp: `example_prime_number_test_seconds_sum` -- すべてのメソッド呼び出しの合計時間

source: `exat(timestamp-seconds)` - Set the specified Unix time at which the key will expire, in seconds.
ja_jp: `exat(timestamp-seconds)`: キーの有効期限が切れる Unix 時間を秒単位で設定します。

source: `exp` (expires at): Five minutes from the current time (customizable with the `smallrye.jwt.new-token.lifespan` property)
ja_jp: `exp` (有効期限): 現在の時刻から 5 分後 (`smallrye.jwt.new-token.lifespan` プロパティーでカスタマイズ可能)

source: `exposed` - does not expose a particular HTTP verb when set to `false`. Default is `true`.
ja_jp: `exposed` - `false` に設定されている場合、特定の HTTP Verb を公開しません。デフォルトは `true` です。

source: `exposed` - whether resource could be exposed. A global resource property that can be overridden for each method. Default is `true`.
ja_jp: `exposed` - リソースが公開される可能性があるかどうか。各メソッドに対してオーバーライド可能なグローバルリソースプロパティー。デフォルトは `true` です。

source: `fabric.selection` is the summary name
ja_jp: `fabric.selection`はサマリー名です。

source: `fail` - fail the application; no more AMQP messages will be processed (default). The AMQP message is marked as rejected.
ja_jp: `fail` - アプリケーションに失敗します。これ以上 AMQP メッセージは処理されません (デフォルト)。AMQP メッセージは拒否済みとしてマークされます。

source: `fail` - fail the application; no more RabbitMQ messages will be processed. The RabbitMQ message is marked as rejected.
ja_jp: `fail` - アプリケーションは失敗し、これ以上 RabbitMQ メッセージは処理されません。RabbitMQ メッセージは拒否済みとしてマークされます。

source: `fail` fail the application, no more messages will be processed.
ja_jp: `fail` の場合、アプリケーションが失敗します。メッセージはそれ以上処理されません。

source: `fail`: fail the application, no more records will be processed (default strategy). The offset of the record that has not been processed correctly is not committed.
ja_jp: `fail`: アプリケーションを失敗させ、それ以上のレコードは処理されません (デフォルトストラテジー)。正しく処理されなかったレコードのオフセットはコミットされません。

source: `false` - the JVM will start with debug mode disabled
ja_jp: `false` - JVMはデバッグモードを無効にして起動します。

source: `fast-jar` is now the default quarkus package type. The result of `./gradlew build` command is a new directory under `build` named `quarkus-app`.
ja_jp: `fast-jar` がデフォルトの quarkus パッケージタイプになりました。 `./gradlew build` コマンドの結果、 `build` の下に `quarkus-app` という名前の新しいディレクトリが作成されます。

source: `fast-jar` is the default quarkus package type.
ja_jp: `fast-jar` は、デフォルトの quarkus パッケージタイプです。

source: `feature()` method is annotated with `@BuildStep` which means it is identified as a deployment task Quarkus will have to execute during the deployment. `BuildStep` methods are run concurrently at augmentation time to augment the application. They use a producer/consumer model, where a step is guaranteed not to be run until all the items that it is consuming have been produced.
ja_jp: `feature()` メソッドには `@BuildStep` というアノテーションが付けられています。これは、Quarkus がデプロイ時に実行しなければならないデプロイタスクとして識別されます。 `BuildStep` メソッドは、アプリケーションを拡張するための拡張時に同時に実行されます。これらは、プロデューサー/コンシューマーモデルを使用しています。このステップは、消費しているすべての項目が生成されるまで、実行されないことが保証されます。

source: `file` - a name segment which corresponds to the `file` field in this class,
ja_jp: `file` - このクラスの `file` フィールドに対応する名前セグメント。

source: `first`: Returns the first element of the given list; throws an `NoSuchElementException` if the list is empty
ja_jp: `first`: 指定されたリストの最初の要素を返します。リストが空の場合、`NoSuchElementException` をスローします。

source: `firstname = :firstname and status = :status` will be mapped to the update document `{'$set' : {'firstname': :firstname, 'status': :status}}`
ja_jp: `firstname = :firstname and status = :status` は、更新ドキュメント `{'$set' : {'firstname': :firstname, 'status': :status}}` にマッピングされます。

source: `firstname = :firstname, status = :status` will be mapped to the update document `{'$set' : {'firstname': :firstname, 'status': :status}}`
ja_jp: `firstname = :firstname, status = :status` は更新ドキュメント `{'$set' : {'firstname': :firstname, 'status': :status}}` にマッピングされます。

source: `firstname = ?1 and status = ?2` will be mapped to `{'firstname': ?1, 'status': ?2}`
ja_jp: `firstname = ?1 and status = ?2` は `{'firstname': ?1, 'status': ?2}` にマッピングされます。

source: `firstname = ?1 and status = ?2` will be mapped to the update document `{'$set' : {'firstname': ?1, 'status': ?2}}`
ja_jp: `firstname = ?1 and status = ?2` は、更新ドキュメント `{'$set' : {'firstname': ?1, 'status': ?2}}` にマッピングされます。

source: `firstname = ?1, status = ?2` will be mapped to the update document `{'$set' : {'firstname': ?1, 'status': ?2}}`
ja_jp: `firstname = ?1, status = ?2` は更新ドキュメント `{'$set' : {'firstname': ?1, 'status': ?2}}` にマッピングされます。

source: `float` and `java.lang.Float`
ja_jp: `float` および `java.lang.Float`

source: `fmt` or `format`: Formats the string instance via `java.lang.String.format()`
ja_jp: `fmt` または `format`: `java.lang.String.format()` によって文字列のインスタンスをフォーマットします。
